app/controllers/food_info_controller.rb

SELECT "food_infos".* FROM "food_infos"
SELECT SUM(carbs) FROM "food_infos"
---
	def show
		@food_info_list = FoodInfo.all